
&НаКлиенте
Процедура пд_ЦифроваяПанельПоискПосле(Команда)
	
	ПодключитьОбработчикОжидания("ПроверитьДанныеССайта", 30, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДанныеССайта()
	
	ПроверитьДанныеССайтаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДанныеССайтаНаСервере()
	
	ОбщегоНазначенияРМКРТ.ПроверитьОтвет(ЭтаФорма, ЭтаФорма.АдресЗаданияНаСайт);
	
КонецПроцедуры

&НаСервере
Процедура пд_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	
	МассивДобавляемыхРеквизов = Новый Массив;
	
	АдресЗадания = Новый РеквизитФормы("АдресЗаданияНаСайт",Новый ОписаниеТипов("Строка"),,"Адрес Задания");
	
	МассивДобавляемыхРеквизов.Добавить(АдресЗадания);
	
	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизов);
	
КонецПроцедуры
