
&После("НайтиБонусыЛокально")
Процедура пд_НайтиБонусыЛокально(Форма) 
	
	ДисконтнаяКарта = Форма.Объект.ДисконтнаяКарта;
	
	НастройкиИнтеграции = пд_ОбменСLegendCity.ПолучитьНастройкиИнтеграции();
	
	Если НастройкиИнтеграции <> Неопределено Тогда
		ПолучатьБонусныйБалансОнлайн  = НастройкиИнтеграции.ПолучатьБонусныйБалансОнлайн;
	Иначе
		ПолучатьБонусныйБалансОнлайн = Ложь;
	КонецЕсли;
		
	Если ПолучатьБонусныйБалансОнлайн И ЗначениеЗаполнено(ДисконтнаяКарта.КодКарты) Тогда
		НаименованиеЗадания = "Получение легенд бонусов";
		ВыполняемыйМетод = "пд_ОбменСLegendCity.ПолучитьБонусы";
	
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(Форма.УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		ПараметрыВыполнения.ОжидатьЗавершения = 120;
		ПараметрыВыполнения.Вставить("КодКарты", ДисконтнаяКарта.КодКарты);

		СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,ВыполняемыйМетод,ПараметрыВыполнения,Форма.УникальныйИдентификатор);		
		СостояниеЗадания = ДлительныеОперацииВызовСервера.ФоновоеЗаданиеЗавершено(СтруктураФоновогоЗадания.ИдентификаторЗадания);
		Если Истина Тогда 
			СтруктураДанныхФормы = Новый Структура;
			ДанныеФормы = ПолучитьИзВременногоХранилища(СтруктураФоновогоЗадания.АдресРезультата).Данные;
			Если ДанныеФормы.Свойство("bonuses") Тогда 
				СтруктураДанныхФормы.Вставить("BonusCount", ДанныеФормы.bonuses);
			Иначе
				СтруктураДанныхФормы.Вставить("BonusCount", 0);
			КонецЕсли;	
			СтруктураДанныхФормы.Вставить("BonusRate", 0);
			СтруктураДанныхФормы.Вставить("PaymentPercent", 100);
			СтруктураДанныхФормы.Вставить("АдресЗаданияССайта", СтруктураФоновогоЗадания.АдресРезультата);
			ИнтерфейсРМКСлужебныйКлиентСервер.ОтобразитьИнформациюОБонусныхБаллах(Форма, СтруктураДанныхФормы);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ПроверитьОтвет(Форма, Адрес) Экспорт
	Если ЗначениеЗаполнено(Адрес) Тогда
		СтруктураДанныхФормы = Новый Структура;
		ДанныеФормы = ПолучитьИзВременногоХранилища(Адрес).Данные;
		Если ДанныеФормы.Свойство("bonuses") Тогда 
			СтруктураДанныхФормы.Вставить("BonusCount", ДанныеФормы.bonuses);
		Иначе
			СтруктураДанныхФормы.Вставить("BonusCount", 0);
		КонецЕсли;	
		СтруктураДанныхФормы.Вставить("BonusRate", 0);
		СтруктураДанныхФормы.Вставить("PaymentPercent", 100);
		СтруктураДанныхФормы.Вставить("АдресЗаданияССайта", Адрес);
		ИнтерфейсРМКСлужебныйКлиентСервер.ОтобразитьИнформациюОБонусныхБаллах(Форма, СтруктураДанныхФормы);
	КонецЕсли;
	
КонецПроцедуры